// @ts-nocheck
import sum from '../sum';

describe('Функция Sum', () => {
  it('Передан только один аргумент', () => {
    expect(() => sum(3)).toThrowError(/^INVALID_ARGUMENTS_COUNT$/);
  });

  it('2 валидных аргумента', () => {
    expect(sum(3, 5)).toBe(8);
  });

  it('Без аргументов', () => {
    expect(() => sum()).toThrowError(/^INVALID_ARGUMENTS_COUNT$/);
  });

  it('2 валидных и 2 невалидных аргумента', () => {
    expect(() => sum({}, [], 5, 2)).toThrowError(/^INVALID_ARGUMENT$/);
  });

  it('2 отрицательных аргумента', () => {
    expect(sum(-3, -2)).toBe(-5);
  });

  it('Большое кол-во аргументов', () => {
    const args = [
      32, 77, 4, 35, 88, 60, 8, 32, 80, 69, 60, 73, 32, 26, 70, 71, 42, 54, 71,
      26,
    ];

    expect(sum(...args)).toBe(1010);
  });

  it('Несколько аргументов, есть 0', () => {
    expect(sum(-3, 10, 0)).toBe(7);
  });

  it('Несколько аргументов с плавающей точкой', () => {
    const args = [
      0.06828557629879706, 0.7463173326230153, 0.9228428910914155,
      0.4101766618854745, 0.901234434701498, 0.6640415369929336,
      0.7413152393694338, 0.13106730101185304, 0.6974128702470208,
      0.1889590785646138, 0.3591400204002311, 0.32024934623938783,
      0.024379735911685296, 0.610672211076605, 0.02017958427850619,
      0.4486312771447114, 0.6321208282053208, 0.9000932226904277,
      0.9885825788036677, 0.2428156311327343,
    ];

    expect(sum(...args)).toBe(10.018517358669332);
  });
});
